sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_rcc.c
    /* Set ICSCR to the reset value */
    RCC->ICSCR = 0x00FF10FF;

    /* Get Start Tick*/
    tickstart = HAL_GetTick();

    /* Reset CFGR register (HSI is selected as system clock source) */
    RCC->CFGR = 0x00000000u;

    /* Wait till HSI is ready */
    while (READ_BIT(RCC->CFGR, RCC_CFGR_SWS) != 0U)
    {
        if ((HAL_GetTick() - tickstart) > CLOCKSWITCH_TIMEOUT_VALUE)
        {
            return HAL_TIMEOUT;
        }
    }

    /* Clear CR register in 2 steps: first to clear HSEON in case bypass was enabled */
    RCC->CR = RCC_CR_HSION;

    /* Then again to HSEBYP in case bypass was enabled */
    RCC->CR = RCC_CR_HSION;

    /* Get Start Tick*/
    tickstart = HAL_GetTick();

    /* Wait till PLL is ready */
//    while (READ_BIT(RCC->CR, RCC_CR_PLLRDY) != 0U)
//    {
//        if ((HAL_GetTick() - tickstart) > PLL_TIMEOUT_VALUE)
//        {
//            return HAL_TIMEOUT;
//        }
//    }

//    /* once PLL is OFF, reset PLLCFGR register to default value */
//    RCC->PLLCFGR = 0x00000000u;//RCC_PLLCFGR_PLLN_4;

    /* Disable all interrupts */
    RCC->CIER = 0x00000000u;

    /* Clear all flags */
    RCC->CICR = 0xFFFFFFFFu;

    /* Update the SystemCoreClock global variable */
    SystemCoreClock = HSI_VALUE;

    /* Adapt Systick interrupt period */
    if (HAL_InitTick(uwTickPrio) != HAL_OK)
    {
        return HAL_ERROR;
    }
    else
    {
        return HAL_OK;
    }
}

/**
  * @brief  Initialize the RCC Oscillators according to the specified parameters in the
  *         @ref RCC_OscInitTypeDef.
  * @param  RCC_OscInitStruct pointer to a @ref RCC_OscInitTypeDef structure that
  *         contains the configuration information for the RCC Oscillators.
  * @note   The PLL is not disabled when used as system clock.
  * @note   Transition HSE Bypass to HSE On and HSE On to HSE Bypass are not
  *         supported by this function. User should request a transition to HSE Off
  *         first and then to HSE On or HSE Bypass.
  * @note   Transition LSE Bypass to LSE On and LSE On to LSE Bypass are not
  *         supported by this function. User should request a transition to LSE Off
  *         first and then to LSE On or LSE Bypass.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RCC_OscConfig(RCC_OscInitTypeDef  *RCC_OscInitStruct)
{
    uint32_t tickstart;
    uint32_t temp_sysclksrc;
//    uint32_t temp_pllckcfg;

    /* Check Null pointer */
    if (RCC_OscInitStruct == NULL)
    {
        return HAL_ERROR;
    }

    /* Check the parameters */
    assert_param(IS_RCC_OSCILLATORTYPE(RCC_OscInitStruct->OscillatorType));

    /*------------------------------- HSE Configuration ------------------------*/
    if (((RCC_OscInitStruct->OscillatorType) & RCC_OSCILLATORTYPE_HSE) == RCC_OSCILLATORTYPE_HSE)
    {
        /* Check the parameters */
        assert_param(IS_RCC_HSE(RCC_OscInitStruct->HSEState));

        temp_sysclksrc = __HAL_RCC_GET_SYSCLK_SOURCE();
//        temp_pllckcfg = __HAL_RCC_GET_PLL_OSCSOURCE();

        /* When the HSE is used as system clock or clock source for PLL in these cases it is not allowed to be disabled */
        if (temp_sysclksrc == RCC_CFGR_SWS_HSE)
        {
            if ((READ_BIT(RCC->CR, RCC_CR_HSERDY) != 0U) && (RCC_OscInitStruct->HSEState == RCC_HSE_OFF))
            {
                return HAL_ERROR;
            }
        }
        else
        {
            SET_BIT(RCC->ECSCR, RCC_ECSCR_HSE_FREQ);//LSQ

            /* Set the new HSE configuration ---------------------------------------*/
            __HAL_RCC_HSE_CONFIG(RCC_OscInitStruct->HSEState);

            /* Check the HSE State */
            if (RCC_OscInitStruct->HSEState != RCC_HSE_OFF)
            {
                /* Get Start Tick*/
                tickstart = HAL_GetTick();

                /* Wait till HSE is ready */
                while (READ_BIT(RCC->CR, RCC_CR_HSERDY) == 0U)
                {
                    if ((HAL_GetTick() - tickstart) > HSE_TIMEOUT_VALUE)
                    {
                        return HAL_TIMEOUT;
                    }
                }
            }
            else
            {
                /* Get Start Tick*/
                tickstart = HAL_GetTick();

                /* Wait till HSE is disabled */
                while (READ_BIT(RCC->CR, RCC_CR_HSERDY) != 0U)
                {
                    if ((HAL_GetTick() - tickstart) > HSE_TIMEOUT_VALUE)
                    {
                        return HAL_TIMEOUT;
                    }
                }
            }
        }
    }
    /*----------------------------- HSI Configuration --------------------------*/
    if (((RCC_OscInitStruct->OscillatorType) & RCC_OSCILLATORTYPE_HSI) == RCC_OSCILLATORTYPE_HSI)
    {
        /* Check the parameters */
        assert_param(IS_RCC_HSI(RCC_OscInitStruct->HSIState));
        assert_param(IS_RCC_HSI_CALIBRATION_VALUE(RCC_OscInitStruct->HSICalibrationValue));
        assert_param(IS_RCC_HSIDIV(RCC_OscInitStruct->HSIDiv));

        /* Check if HSI16 is used as system clock or as PLL source when PLL is selected as system clock */
        temp_sysclksrc = __HAL_RCC_GET_SYSCLK_SOURCE();
//        temp_pllckcfg = __HAL_RCC_GET_PLL_OSCSOURCE();
        if (temp_sysclksrc == RCC_CFGR_SWS_HSI)
        {
            /* When HSI is used as system clock or as PLL input clock it can not be disabled */
            if ((READ_BIT(RCC->CR, RCC_CR_HSIRDY) != 0U) && (RCC_OscInitStruct->HSIState == RCC_HSI_OFF))
            {
                return HAL_ERROR;
            }
            /* Otherwise, just the calibration is allowed */
            else
            {
                /* Adjusts the Internal High Speed oscillator (HSI) calibration value.*/
                __HAL_RCC_HSI_CALIBRATIONVALUE_ADJUST(RCC_OscInitStruct->HSICalibrationValue);
                
                /* Get Start Tick*/
                tickstart = HAL_GetTick();

                /* Wait till HSI is ready */
                while (READ_BIT(RCC->CR, RCC_CR_HSIRDY) == 0U)
                {
                    if ((HAL_GetTick() - tickstart) > HSI_TIMEOUT_VALUE)
                    {
                        return HAL_TIMEOUT;
                    }
                }

                if (temp_sysclksrc == RCC_CFGR_SWS_HSI)
                {
                    /* Adjust the HSI16 division factor */
                    __HAL_RCC_HSI_CONFIG(RCC_OscInitStruct->HSIDiv);

                    /* Update the SystemCoreClock global variable with HSISYS value  */
                    SystemCoreClock = (HSI_VALUE / (1UL << ((READ_BIT(RCC->CR, RCC_CR_HSIDIV)) >> RCC_CR_HSIDIV_Pos)));
                }

