sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_rcc.c
                /* Adapt Systick interrupt period */
                if (HAL_InitTick(uwTickPrio) != HAL_OK)
                {
                    return HAL_ERROR;
                }
            }
        }
        else
        {
            /* Check the HSI State */
            if (RCC_OscInitStruct->HSIState != RCC_HSI_OFF)
            {
                /* Configure the HSI16 division factor */
                __HAL_RCC_HSI_CONFIG(RCC_OscInitStruct->HSIDiv);

                /* Enable the Internal High Speed oscillator (HSI16). */
                __HAL_RCC_HSI_ENABLE();

                /* Get Start Tick*/
                tickstart = HAL_GetTick();

                /* Wait till HSI is ready */
                while (READ_BIT(RCC->CR, RCC_CR_HSIRDY) == 0U)
                {
                    if ((HAL_GetTick() - tickstart) > HSI_TIMEOUT_VALUE)
                    {
                        return HAL_TIMEOUT;
                    }
                }

                /* Adjusts the Internal High Speed oscillator (HSI) calibration value.*/
                __HAL_RCC_HSI_CALIBRATIONVALUE_ADJUST(RCC_OscInitStruct->HSICalibrationValue);
            }
            else
            {
                /* Disable the Internal High Speed oscillator (HSI16). */
                __HAL_RCC_HSI_DISABLE();

                /* Get Start Tick*/
                tickstart = HAL_GetTick();

                /* Wait till HSI is disabled */
                while (READ_BIT(RCC->CR, RCC_CR_HSIRDY) != 0U)
                {
                    if ((HAL_GetTick() - tickstart) > HSI_TIMEOUT_VALUE)
                    {
                        return HAL_TIMEOUT;
                    }
                }
            }
        }
    }
    /*------------------------------ LSI Configuration -------------------------*/
    if (((RCC_OscInitStruct->OscillatorType) & RCC_OSCILLATORTYPE_LSI) == RCC_OSCILLATORTYPE_LSI)
    {
        /* Check the parameters */
        assert_param(IS_RCC_LSI(RCC_OscInitStruct->LSIState));

        /* Check if LSI is used as system clock */
        if (__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_CFGR_SWS_LSI)
        {
            /* When LSI is used as system clock it will not be disabled */
            if ((((RCC->CSR) & RCC_CSR_LSIRDY) != 0U) && (RCC_OscInitStruct->LSIState == RCC_LSI_OFF))
            {
                return HAL_ERROR;
            }
        }
        else
        {
            /* Check the LSI State */
            if (RCC_OscInitStruct->LSIState != RCC_LSI_OFF)
            {
                /* Enable the Internal Low Speed oscillator (LSI). */
                __HAL_RCC_LSI_ENABLE();

                /* Get Start Tick*/
                tickstart = HAL_GetTick();

                /* Wait till LSI is ready */
                while (READ_BIT(RCC->CSR, RCC_CSR_LSIRDY) == 0U)
                {
                    if ((HAL_GetTick() - tickstart) > LSI_TIMEOUT_VALUE)
                    {
                        return HAL_TIMEOUT;
                    }
                }
            }
            else
            {
                /* Disable the Internal Low Speed oscillator (LSI). */
                __HAL_RCC_LSI_DISABLE();

                /* Get Start Tick*/
                tickstart = HAL_GetTick();

                /* Wait till LSI is disabled */
                while (READ_BIT(RCC->CSR, RCC_CSR_LSIRDY) != 0U)
                {
                    if ((HAL_GetTick() - tickstart) > LSI_TIMEOUT_VALUE)
                    {
                        return HAL_TIMEOUT;
                    }
                }
            }
        }
    }
    /*------------------------------ LSE Configuration -------------------------*/
//    if (((RCC_OscInitStruct->OscillatorType) & RCC_OSCILLATORTYPE_LSE) == RCC_OSCILLATORTYPE_LSE)
//    {
//        FlagStatus       pwrclkchanged = RESET;

//        /* Check the parameters */
//        assert_param(IS_RCC_LSE(RCC_OscInitStruct->LSEState));

//        /* When the LSE is used as system clock, it is not allowed disable it */
//        if (__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_CFGR_SWS_LSE)
//        {
//            if ((((RCC->BDCR) & RCC_BDCR_LSERDY) != 0U) && (RCC_OscInitStruct->LSEState == RCC_LSE_OFF))
//            {
//                return HAL_ERROR;
//            }
//        }
//        else
//        {
//            /* Update LSE configuration in Backup Domain control register    */
//            /* Requires to enable write access to Backup Domain of necessary */
//            if (__HAL_RCC_PWR_IS_CLK_DISABLED() != 0U)    //no Backup domain
//            {
//                __HAL_RCC_PWR_CLK_ENABLE();
//                pwrclkchanged = SET;
//            }

//            if (HAL_IS_BIT_CLR(PWR->CR1, PWR_CR1_DBP))
//            {
//                /* Enable write access to Backup domain */
//                SET_BIT(PWR->CR1, PWR_CR1_DBP);

//                /* Wait for Backup domain Write protection disable */
//                tickstart = HAL_GetTick();

//                while (HAL_IS_BIT_CLR(PWR->CR1, PWR_CR1_DBP))
//                {
//                    if ((HAL_GetTick() - tickstart) > RCC_DBP_TIMEOUT_VALUE)
//                    {
//                        return HAL_TIMEOUT;
//                    }
//                }
//            }

//            /* Set the new LSE configuration -----------------------------------------*/
//            __HAL_RCC_LSE_CONFIG(RCC_OscInitStruct->LSEState);

//            /* Check the LSE State */
//            if (RCC_OscInitStruct->LSEState != RCC_LSE_OFF)
//            {
//                /* Get Start Tick*/
//                tickstart = HAL_GetTick();

//                /* Wait till LSE is ready */
//                while (READ_BIT(RCC->BDCR, RCC_BDCR_LSERDY) == 0U)
//                {
//                    if ((HAL_GetTick() - tickstart) > RCC_LSE_TIMEOUT_VALUE)
//                    {
//                        return HAL_TIMEOUT;
//                    }
//                }
//            }
//            else
//            {
//                /* Get Start Tick*/
//                tickstart = HAL_GetTick();

