sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_rcc.c
//                /* Wait till LSE is disabled */
//                while (READ_BIT(RCC->BDCR, RCC_BDCR_LSERDY) != 0U)
//                {
//                    if ((HAL_GetTick() - tickstart) > RCC_LSE_TIMEOUT_VALUE)
//                    {
//                        return HAL_TIMEOUT;
//                    }
//                }
//            }

//            /* Restore clock configuration if changed */
//            if (pwrclkchanged == SET)
//            {
//                __HAL_RCC_PWR_CLK_DISABLE();
//            }
//        }
//    }
//    /*-------------------------------- PLL Configuration -----------------------*/
//    /* Check the parameters */
//    assert_param(IS_RCC_PLL(RCC_OscInitStruct->PLL.PLLState));

//    if (RCC_OscInitStruct->PLL.PLLState != RCC_PLL_NONE)
//    {
//        /* Check if the PLL is used as system clock or not */
//        if (__HAL_RCC_GET_SYSCLK_SOURCE() != RCC_CFGR_SWS_PLL)
//        {
//            if (RCC_OscInitStruct->PLL.PLLState == RCC_PLL_ON)
//            {
//                /* Check the parameters */
//                assert_param(IS_RCC_PLLSOURCE(RCC_OscInitStruct->PLL.PLLSource));
//                assert_param(IS_RCC_PLLM_VALUE(RCC_OscInitStruct->PLL.PLLM));
//                assert_param(IS_RCC_PLLN_VALUE(RCC_OscInitStruct->PLL.PLLN));
//                assert_param(IS_RCC_PLLP_VALUE(RCC_OscInitStruct->PLL.PLLP));
//#if defined(RCC_PLLQ_SUPPORT)
//                assert_param(IS_RCC_PLLQ_VALUE(RCC_OscInitStruct->PLL.PLLQ));
//#endif
//                assert_param(IS_RCC_PLLR_VALUE(RCC_OscInitStruct->PLL.PLLR));

//                /* Disable the main PLL. */
//                __HAL_RCC_PLL_DISABLE();

//                /* Get Start Tick*/
//                tickstart = HAL_GetTick();

//                /* Wait till PLL is ready */
//                while (READ_BIT(RCC->CR, RCC_CR_PLLRDY) != 0U)
//                {
//                    if ((HAL_GetTick() - tickstart) > PLL_TIMEOUT_VALUE)
//                    {
//                        return HAL_TIMEOUT;
//                    }
//                }

//                /* Configure the main PLL clock source, multiplication and division factors. */
////        __HAL_RCC_PLL_CONFIG(RCC_OscInitStruct->PLL.PLLSource,
////                             RCC_OscInitStruct->PLL.PLLM,
////                             RCC_OscInitStruct->PLL.PLLN,
////                             RCC_OscInitStruct->PLL.PLLP,
////#if defined(RCC_PLLQ_SUPPORT)
////                             RCC_OscInitStruct->PLL.PLLQ,
////#endif
////                             RCC_OscInitStruct->PLL.PLLR);
//                __HAL_RCC_PLL_CONFIG(RCC_OscInitStruct->PLL.PLLSource);

//                /* Enable the main PLL. */
//                __HAL_RCC_PLL_ENABLE();

//                /* Enable PLLR Clock output. */
////        __HAL_RCC_PLLCLKOUT_ENABLE(RCC_PLLRCLK);

//                /* Get Start Tick*/
//                tickstart = HAL_GetTick();

//                /* Wait till PLL is ready */
//                while (READ_BIT(RCC->CR, RCC_CR_PLLRDY) == 0U)
//                {
//                    if ((HAL_GetTick() - tickstart) > PLL_TIMEOUT_VALUE)
//                    {
//                        return HAL_TIMEOUT;
//                    }
//                }
//            }
//            else
//            {
//                /* Disable the main PLL. */
//                __HAL_RCC_PLL_DISABLE();

//                /* Disable all PLL outputs to save power */
//                MODIFY_REG(RCC->PLLCFGR, RCC_PLLCFGR_PLLSRC, PLLSOURCE_NONE);

//#if defined(RCC_PLLQ_SUPPORT)
//                __HAL_RCC_PLLCLKOUT_DISABLE(RCC_PLLCFGR_PLLPEN | RCC_PLLCFGR_PLLQEN | RCC_PLLCFGR_PLLREN);
//#else
////        __HAL_RCC_PLLCLKOUT_DISABLE(RCC_PLLCFGR_PLLPEN | RCC_PLLCFGR_PLLREN);
//#endif

//                /* Get Start Tick*/
//                tickstart = HAL_GetTick();

//                /* Wait till PLL is disabled */
//                while (READ_BIT(RCC->CR, RCC_CR_PLLRDY) != 0U)
//                {
//                    if ((HAL_GetTick() - tickstart) > PLL_TIMEOUT_VALUE)
//                    {
//                        return HAL_TIMEOUT;
//                    }
//                }
//            }
//        }
//        else
//        {
//            /* Check if there is a request to disable the PLL used as System clock source */
//            if((RCC_OscInitStruct->PLL.PLLState) == RCC_PLL_OFF)
//            {
//                return HAL_ERROR;
//            }
//            else
//            {
//                /* Do not return HAL_ERROR if request repeats the current configuration */
//                temp_pllckcfg = RCC->PLLCFGR;
////        if((READ_BIT(temp_pllckcfg, RCC_PLLCFGR_PLLSRC) != RCC_OscInitStruct->PLL.PLLSource) ||
////           (READ_BIT(temp_pllckcfg, RCC_PLLCFGR_PLLM) != RCC_OscInitStruct->PLL.PLLM) ||
////           (READ_BIT(temp_pllckcfg, RCC_PLLCFGR_PLLN) != (RCC_OscInitStruct->PLL.PLLN << RCC_PLLCFGR_PLLN_Pos)) ||
////           (READ_BIT(temp_pllckcfg, RCC_PLLCFGR_PLLP) != RCC_OscInitStruct->PLL.PLLP) ||
////#if defined (RCC_PLLQ_SUPPORT)
////           (READ_BIT(temp_pllckcfg, RCC_PLLCFGR_PLLQ) != RCC_OscInitStruct->PLL.PLLQ) ||
////#endif
////           (READ_BIT(temp_pllckcfg, RCC_PLLCFGR_PLLR) != RCC_OscInitStruct->PLL.PLLR))
//                if(READ_BIT(temp_pllckcfg, RCC_PLLCFGR_PLLSRC) != RCC_OscInitStruct->PLL.PLLSource)
//                {
//                    return HAL_ERROR;
//                }
//            }
//        }
//    }
    return HAL_OK;
}

/**
  * @brief  Initialize the CPU, AHB and APB busses clocks according to the specified
  *         parameters in the RCC_ClkInitStruct.
  * @param  RCC_ClkInitStruct  pointer to a @ref RCC_ClkInitTypeDef structure that
  *         contains the configuration information for the RCC peripheral.
  * @param  FLatency  FLASH Latency
  *          This parameter can be one of the following values:
  *            @arg FLASH_LATENCY_0   FLASH 0 Latency cycle
  *            @arg FLASH_LATENCY_1   FLASH 1 Latency cycle
  *
  * @note   The SystemCoreClock CMSIS variable is used to store System Clock Frequency
  *         and updated by @ref HAL_RCC_GetHCLKFreq() function called within this function
  *
  * @note   The HSI is used by default as system clock source after
  *         startup from Reset, wake-up from STANDBY mode. After restart from Reset,
  *         the HSI frequency is set to 8 Mhz, then it reaches its default value 16 MHz.
  *
  * @note   The HSI can be selected as system clock source after
  *         from STOP modes or in case of failure of the HSE used directly or indirectly
  *         as system clock (if the Clock Security System CSS is enabled).
  *
  * @note   The LSI can be selected as system clock source after
  *         in case of failure of the LSE used directly or indirectly
  *         as system clock (if the Clock Security System LSECSS is enabled).
  *
  * @note   A switch from one clock source to another occurs only if the target
  *         clock source is ready (clock stable after startup delay or PLL locked).
  *         If a clock source which is not yet ready is selected, the switch will
  *         occur when the clock source is ready.
  *
  * @note   You can use @ref HAL_RCC_GetClockConfig() function to know which clock is
  *         currently used as system clock source.
  *
  * @note   Depending on the device voltage range, the software has to set correctly
  *         HPRE[3:0] bits to ensure that HCLK not exceed the maximum allowed frequency
  *         (for more details refer to section above "Initialization/de-initialization functions")
  * @retval None
  */
HAL_StatusTypeDef HAL_RCC_ClockConfig(RCC_ClkInitTypeDef  *RCC_ClkInitStruct, uint32_t FLatency)
{
    uint32_t tickstart;

    /* Check Null pointer */
    if (RCC_ClkInitStruct == NULL)
    {
        return HAL_ERROR;
    }

    /* Check the parameters */
    assert_param(IS_RCC_CLOCKTYPE(RCC_ClkInitStruct->ClockType));
    assert_param(IS_FLASH_LATENCY(FLatency));

    /* To correctly read data from FLASH memory, the number of wait states (LATENCY)
      must be correctly programmed according to the frequency of the FLASH clock
      (HCLK) and the supply voltage of the device. */

