sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_rcc.c
    /* MCO Clock Enable */
    MCO1_CLK_ENABLE();

    /* Configue the MCO1 pin in alternate function mode */
    GPIO_InitStruct.Pin = MCO1_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Alternate = GPIO_AF15_MCO;
    HAL_GPIO_Init(MCO1_GPIO_PORT, &GPIO_InitStruct);

    /* Mask MCOSEL[] and MCOPRE[] bits then set MCO1 clock source and prescaler */
    MODIFY_REG(RCC->CFGR, (RCC_CFGR_MCOSEL | RCC_CFGR_MCOPRE), (RCC_MCOSource | RCC_MCODiv));
}

/**
  * @brief  Return the SYSCLK frequency.
  *
  * @note   The system frequency computed by this function is not the real
  *         frequency in the chip. It is calculated based on the predefined
  *         constant and the selected clock source:
  * @note     If SYSCLK source is HSI, function returns values based on HSI_VALUE/HSIDIV(*)
  * @note     If SYSCLK source is HSE, function returns values based on HSE_VALUE(**)
  * @note     If SYSCLK source is PLL, function returns values based on HSE_VALUE(**),
  *           or HSI_VALUE(*) multiplied/divided by the PLL factors.
  * @note     If SYSCLK source is LSI, function returns values based on LSI_VALUE(***)
  * @note     If SYSCLK source is LSE, function returns values based on LSE_VALUE(****)
  * @note     (*) HSI_VALUE is a constant defined in py32f003_hal_conf.h file (default value
  *               16 MHz) but the real value may vary depending on the variations
  *               in voltage and temperature.
  * @note     (**) HSE_VALUE is a constant defined in py32f003_hal_conf.h file (default value
  *                8 MHz), user has to ensure that HSE_VALUE is same as the real
  *                frequency of the crystal used. Otherwise, this function may
  *                have wrong result.
  * @note     (***) LSE_VALUE is a constant defined in py32f003_hal_conf.h file (default value
  *               32768 Hz).
  * @note     (****) LSI_VALUE is a constant defined in py32f003_hal_conf.h file (default value
  *               32000 Hz).
  *
  * @note   The result of this function could be not correct when using fractional
  *         value for HSE crystal.
  *
  * @note   This function can be used by the user application to compute the
  *         baudrate for the communication peripherals or configure other parameters.
  *
  * @note   Each time SYSCLK changes, this function must be called to update the
  *         right SYSCLK value. Otherwise, any configuration based on this function will be incorrect.
  *
  *
  * @retval SYSCLK frequency
  */
uint32_t HAL_RCC_GetSysClockFreq(void)
{
//    uint32_t pllsource;
    uint32_t hsidiv;
    uint32_t sysclockfreq;
    const uint32_t hsiValue[5] = {4000000,8000000,16000000,22120000,24000000};
    uint32_t hsiIndex;

    if (__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_CFGR_SWS_HSI)
    {
        /* HSISYS can be derived for HSI16 */
        hsidiv = (1UL << ((READ_BIT(RCC->CR, RCC_CR_HSIDIV)) >> RCC_CR_HSIDIV_Pos));

        /* HSI used as system clock source */
        hsiIndex = (RCC->ICSCR&RCC_ICSCR_HSI_FS_Msk)>>RCC_ICSCR_HSI_FS_Pos;
        if (hsiIndex > 4)
        {
            hsiIndex = 0;
        }
        sysclockfreq = (hsiValue[hsiIndex] / hsidiv);
    }
    else if (__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_CFGR_SWS_HSE)
    {
        /* HSE used as system clock source */
        sysclockfreq = HSE_VALUE;
    }
//    else if (__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_CFGR_SWS_PLL)
//    {
//        pllsource = (RCC->PLLCFGR & RCC_PLLCFGR_PLLSRC);

//        switch (pllsource)
//        {
//        case RCC_PLLSOURCE_HSE:  /* HSE used as PLL clock source */
//            sysclockfreq =  HSE_VALUE  * 2;
//            break;

//        case RCC_PLLSOURCE_HSI:  /* HSI16 used as PLL clock source */
//            hsiIndex = (RCC->ICSCR&RCC_ICSCR_HSI_FS_Msk)>>RCC_ICSCR_HSI_FS_Pos;
//            if (hsiIndex > 4)
//            {
//                hsiIndex = 0;
//            }
//            sysclockfreq =  hsiValue[hsiIndex]  * 2;
//            break;
//            
//        default:                 /* HSI16 used as PLL clock source */
//            sysclockfreq = hsiValue[4]  * 2;
//            break;
//        }
//    }
//    else if (__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_CFGR_SWS_LSE)
//    {
//        /* LSE used as system clock source */
//        sysclockfreq = LSE_VALUE;
//    }
    else if (__HAL_RCC_GET_SYSCLK_SOURCE() == RCC_CFGR_SWS_LSI)
    {
        /* LSI used as system clock source */
        sysclockfreq = LSI_VALUE;
    }
    else
    {
        sysclockfreq = 0U;
    }

    return sysclockfreq;
}

/**
  * @brief  Return the HCLK frequency.
  * @note   Each time HCLK changes, this function must be called to update the
  *         right HCLK value. Otherwise, any configuration based on this function will be incorrect.
  *
  * @note   The SystemCoreClock CMSIS variable is used to store System Clock Frequency.
  * @retval HCLK frequency in Hz
  */
uint32_t HAL_RCC_GetHCLKFreq(void)
{
    return SystemCoreClock;
}

/**
  * @brief  Return the PCLK1 frequency.
  * @note   Each time PCLK1 changes, this function must be called to update the
  *         right PCLK1 value. Otherwise, any configuration based on this function will be incorrect.
  * @retval PCLK1 frequency in Hz
  */
uint32_t HAL_RCC_GetPCLK1Freq(void)
{
    /* Get HCLK source and Compute PCLK1 frequency ---------------------------*/
    return ((uint32_t)(__LL_RCC_CALC_PCLK1_FREQ(HAL_RCC_GetHCLKFreq(), LL_RCC_GetAPB1Prescaler())));
}

/**
  * @brief  Configure the RCC_OscInitStruct according to the internal
  *         RCC configuration registers.
  * @param  RCC_OscInitStruct  pointer to an RCC_OscInitTypeDef structure that
  *         will be configured.
  * @retval None
  */
void HAL_RCC_GetOscConfig(RCC_OscInitTypeDef  *RCC_OscInitStruct)
{
    /* Check the parameters */
    assert_param(RCC_OscInitStruct != (void *)NULL);

    /* Set all possible values for the Oscillator type parameter ---------------*/
    RCC_OscInitStruct->OscillatorType = RCC_OSCILLATORTYPE_HSE | RCC_OSCILLATORTYPE_HSI | RCC_OSCILLATORTYPE_LSI;

    /* Get the HSE configuration -----------------------------------------------*/
    if ((RCC->CR & RCC_CR_HSEBYP) == RCC_CR_HSEBYP)
    {
        RCC_OscInitStruct->HSEState = RCC_HSE_BYPASS;
    }
    else if ((RCC->CR & RCC_CR_HSEON) == RCC_CR_HSEON)
    {
        RCC_OscInitStruct->HSEState = RCC_HSE_ON;
    }
    else
    {
        RCC_OscInitStruct->HSEState = RCC_HSE_OFF;
    }

    /* Get the HSI configuration -----------------------------------------------*/
    if ((RCC->CR & RCC_CR_HSION) == RCC_CR_HSION)
    {
        RCC_OscInitStruct->HSIState = RCC_HSI_ON;
    }
    else
    {
        RCC_OscInitStruct->HSIState = RCC_HSI_OFF;
    }

    RCC_OscInitStruct->HSICalibrationValue = ((RCC->ICSCR & RCC_ICSCR_HSI_TRIM) >> RCC_ICSCR_HSI_TRIM_Pos);
    RCC_OscInitStruct->HSIDiv = ((RCC->CR & RCC_CR_HSIDIV) >> RCC_CR_HSIDIV_Pos);

