sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_rcc.c
    /* Get the LSE configuration -----------------------------------------------*/
//    if ((RCC->BDCR & RCC_BDCR_LSEBYP) == RCC_BDCR_LSEBYP)
//    {
//        RCC_OscInitStruct->LSEState = RCC_LSE_BYPASS;
//    }
//    else if ((RCC->BDCR & RCC_BDCR_LSEON) == RCC_BDCR_LSEON)
//    {
//        RCC_OscInitStruct->LSEState = RCC_LSE_ON;
//    }
//    else
//    {
//        RCC_OscInitStruct->LSEState = RCC_LSE_OFF;
//    }

    /* Get the LSI configuration -----------------------------------------------*/
    if ((RCC->CSR & RCC_CSR_LSION) == RCC_CSR_LSION)
    {
        RCC_OscInitStruct->LSIState = RCC_LSI_ON;
    }
    else
    {
        RCC_OscInitStruct->LSIState = RCC_LSI_OFF;
    }


    /* Get the PLL configuration -----------------------------------------------*/
//    if ((RCC->CR & RCC_CR_PLLON) == RCC_CR_PLLON)
//    {
//        RCC_OscInitStruct->PLL.PLLState = RCC_PLL_ON;
//    }
//    else
//    {
//        RCC_OscInitStruct->PLL.PLLState = RCC_PLL_OFF;
//    }
//  RCC_OscInitStruct->PLL.PLLSource = (RCC->PLLCFGR & RCC_PLLCFGR_PLLSRC);
//  RCC_OscInitStruct->PLL.PLLM = (RCC->PLLCFGR & RCC_PLLCFGR_PLLM);
//  RCC_OscInitStruct->PLL.PLLN = ((RCC->PLLCFGR & RCC_PLLCFGR_PLLN) >> RCC_PLLCFGR_PLLN_Pos);
//  RCC_OscInitStruct->PLL.PLLP = (RCC->PLLCFGR & RCC_PLLCFGR_PLLP);
//#if defined(RCC_PLLQ_SUPPORT)
//  RCC_OscInitStruct->PLL.PLLQ = (RCC->PLLCFGR & RCC_PLLCFGR_PLLQ);
//#endif
//  RCC_OscInitStruct->PLL.PLLR = (RCC->PLLCFGR & RCC_PLLCFGR_PLLR);
}

/**
  * @brief  Configure the RCC_ClkInitStruct according to the internal
  *         RCC configuration registers.
  * @param  RCC_ClkInitStruct Pointer to a @ref RCC_ClkInitTypeDef structure that
  *                           will be configured.
  * @param  pFLatency         Pointer on the Flash Latency.
  * @retval None
  */
void HAL_RCC_GetClockConfig(RCC_ClkInitTypeDef  *RCC_ClkInitStruct, uint32_t *pFLatency)
{
    /* Check the parameters */
    assert_param(RCC_ClkInitStruct != (void *)NULL);
    assert_param(pFLatency != (void *)NULL);

    /* Set all possible values for the Clock type parameter --------------------*/
    RCC_ClkInitStruct->ClockType = RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1;

    /* Get the SYSCLK configuration --------------------------------------------*/
    RCC_ClkInitStruct->SYSCLKSource = (uint32_t)(RCC->CFGR & RCC_CFGR_SW);

    /* Get the HCLK configuration ----------------------------------------------*/
    RCC_ClkInitStruct->AHBCLKDivider = (uint32_t)(RCC->CFGR & RCC_CFGR_HPRE);

    /* Get the APB1 configuration ----------------------------------------------*/
    RCC_ClkInitStruct->APB1CLKDivider = (uint32_t)(RCC->CFGR & RCC_CFGR_PPRE);


    /* Get the Flash Wait State (Latency) configuration ------------------------*/
    *pFLatency = (uint32_t)(FLASH->ACR & FLASH_ACR_LATENCY);
}

/**
  * @brief  Enable the Clock Security System.
  * @note   If a failure is detected on the HSE oscillator clock, this oscillator
  *         is automatically disabled and an interrupt is generated to inform the
  *         software about the failure (Clock Security System Interrupt, CSSI),
  *         allowing the MCU to perform rescue operations. The CSSI is linked to
  *         the Cortex-M0+ NMI (Non-Maskable Interrupt) exception vector.
  * @note   The Clock Security System can only be cleared by reset.
  * @retval None
  */
void HAL_RCC_EnableCSS(void)
{
    SET_BIT(RCC->CR, RCC_CR_CSSON) ;
}

///**
//  * @brief  Enable the LSE Clock Security System.
//  * @note   If a failure is detected on the LSE oscillator clock, this oscillator
//  *         is automatically disabled and an interrupt is generated to inform the
//  *         software about the failure (Clock Security System Interrupt, CSSI),
//  *         allowing the MCU to perform rescue operations. The CSSI is linked to
//  *         the Cortex-M0+ NMI (Non-Maskable Interrupt) exception vector.
//  * @note   The LSE Clock Security System Detection bit (LSECSSD in BDCR) can only be
//  *         cleared by a backup domain reset.
//  * @retval None
//  */
//void HAL_RCC_EnableLSECSS(void)
//{
//  SET_BIT(RCC->BDCR, RCC_BDCR_LSECSSON) ;
//}

///**
//  * @brief  Disable the LSE Clock Security System.
//  * @note   After LSE failure detection, the software must disable LSECSSON
//  * @note   The Clock Security System can only be cleared by reset otherwise.
//  * @retval None
//  */
//void HAL_RCC_DisableLSECSS(void)
//{
//  CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSECSSON) ;
//}

/**
  * @brief Handle the RCC Clock Security System interrupt request.
  * @note  This API should be called under the NMI_Handler().
  * @retval None
  */
void HAL_RCC_NMI_IRQHandler(void)
{
    uint32_t itflag = RCC->CIFR;

    /* Clear interrupt flags related to CSS */
    RCC->CICR = (itflag & (RCC_CIFR_CSSF));// | RCC_CIFR_LSECSSF));

    /* Check RCC CSSF interrupt flag  */
    if ((itflag & RCC_CIFR_CSSF) != 0x00u)
    {
        /* RCC Clock Security System interrupt user callback */
        HAL_RCC_CSSCallback();
    }

//  /* Check RCC LSECSSF interrupt flag  */
//  if ((itflag & RCC_CIFR_LSECSSF) != 0x00u)
//  {
//    /* RCC Clock Security System interrupt user callback */
//    HAL_RCC_LSECSSCallback();
//  }
}

/**
  * @brief Handle the RCC HSE Clock Security System interrupt callback.
  * @retval none
  */
__weak void HAL_RCC_CSSCallback(void)
{
    /* NOTE : This function should not be modified, when the callback is needed,
              the @ref HAL_RCC_CSSCallback should be implemented in the user file
     */
}

/**
  * @brief  RCC LSE Clock Security System interrupt callback.
  * @retval none
  */
//__weak void HAL_RCC_LSECSSCallback(void)
//{
//    /* NOTE : This function should not be modified, when the callback is needed,
//              the HAL_RCC_LSECSSCallback should be implemented in the user file
//     */
//}

/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_RCC_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT Puya *****END OF FILE****/
